In [1]:
# Pyber Challenge

In [2]:
### 4.3 Loading and Reading CSV files

In [3]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [4]:
# File to Load (Remember to change these)
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

In [5]:
### Merge the DataFrames

In [6]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [7]:
## Deliverable 1: Get a Summary DataFrame

In [8]:
#  1. Get the total rides for each city type

In [9]:
# Count total rides for each city
sum_ride_by_type = pyber_data_df.groupby(["type"]).count()["ride_id"]
sum_ride_by_type

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [10]:
# Step 2 Count total driver for each city
sum_driver_by_type = city_data_df.groupby(["type"]).sum()["driver_count"]
sum_driver_by_type

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [11]:
# Step 3 Get the total of the fares for each city type.
sum_fares_by_type = pyber_data_df.groupby(["type"]).sum()["fare"]
sum_fares_by_type

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [12]:
# Step 4 Get the average of the fares for each city type.
aver_fares_per_ride_by_type = sum_fares_by_type/sum_ride_by_type
aver_fares_per_ride_by_type

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
dtype: float64

In [13]:
# Step 5 Get the average of the fares for each city type.
aver_fares_per_driver_by_type = sum_fares_by_type/sum_driver_by_type
aver_fares_per_driver_by_type

type
Rural       55.486282
Suburban    39.502714
Urban       16.571468
dtype: float64

In [14]:
# Create a PyBer DataFrame
pyber_summary_df = pd.DataFrame(
          {"Total Rides": sum_ride_by_type, 
          "Total Drivers": sum_driver_by_type, 
          "Total Fares": sum_fares_by_type,
          "Average Fare per Ride": aver_fares_per_ride_by_type, 
          "Average Fare per Driver": aver_fares_per_driver_by_type})

In [15]:
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
type,,,,,
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [16]:
# Step 7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None

In [17]:
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [18]:
# Step 8 Format the columns
pyber_summary_df["Total Rides"] = pyber_summary_df["Total Rides"].map("{:,}".format)
pyber_summary_df["Total Drivers"] = pyber_summary_df["Total Drivers"].map("{:,}".format)
pyber_summary_df["Total Fares"] = pyber_summary_df["Total Fares"].map("${:,.2f}".format)
pyber_summary_df["Average Fare per Ride"] = pyber_summary_df["Average Fare per Ride"].map("${:,.2f}".format)
pyber_summary_df["Average Fare per Driver"] = pyber_summary_df["Average Fare per Driver"].map("${:,.2f}".format)

# Display the data frame
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,"1,625","2,405","$39,854.38",$24.53,$16.57

In [19]:
## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [20]:
# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [21]:
city_sum_fare_by_date = pyber_data_df.groupby(["type" , "date"]).sum()[["fare"]]
city_sum_fare_by_date.head(10)

                            fare
type  date
Rural 2019-01-01 09:45:36  43.69
      2019-01-02 11:18:32  52.12
      2019-01-03 19:51:01  19.90
      2019-01-04 03:31:26  24.88
      2019-01-06 07:38:40  47.33
      2019-01-08 06:19:45  19.39
      2019-01-09 15:30:35  31.84
      2019-01-11 04:39:27  16.42
      2019-01-14 07:09:17  18.05
      2019-01-14 15:58:48  54.10

In [22]:
#Step 10 df = df.reset_index()
city_sum_fare_by_date = city_sum_fare_by_date.reset_index()

In [23]:
city_sum_fare_by_date.tail(10)

       type                 date   fare
2365  Urban  2019-05-07 17:27:48   6.39
2366  Urban  2019-05-07 20:05:15  24.20
2367  Urban  2019-05-07 20:22:19  18.74
2368  Urban  2019-05-08 01:54:18  32.69
2369  Urban  2019-05-08 02:31:25  41.33
2370  Urban  2019-05-08 04:20:00  21.99
2371  Urban  2019-05-08 04:39:49  18.45
2372  Urban  2019-05-08 07:29:01  18.55
2373  Urban  2019-05-08 11:38:35  19.77
2374  Urban  2019-05-08 13:10:18  18.04

In [24]:
#Step 11 use the pivot() function to convert the DataFrame
city_sum_fare_by_date_pivot = city_sum_fare_by_date.pivot(index = "date" , columns = "type", values ="fare")
city_sum_fare_by_date_pivot.head(10)

type                 Rural  Suburban  Urban
date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
2019-01-01 09:45:36  43.69       NaN    NaN
2019-01-01 12:32:48    NaN     25.56    NaN
2019-01-01 14:40:14    NaN       NaN   5.42
2019-01-01 14:42:25    NaN       NaN  12.31
2019-01-01 14:52:06    NaN     31.15    NaN

In [42]:
#Step 12 Create new dataframe using loc
city_sum_fare_by_date_pivot

type                 Rural  Suburban  Urban
date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
...                    ...       ...    ...
2019-05-08 04:20:00    NaN       NaN  21.99
2019-05-08 04:39:49    NaN       NaN  18.45
2019-05-08 07:29:01    NaN       NaN  18.55
2019-05-08 11:38:35    NaN       NaN  19.77
2019-05-08 13:10:18    NaN       NaN  18.04

[2375 rows x 3 columns]

In [39]:
city_sum_fare_by_date_filter = city_sum_fare_by_date_pivot.loc["2019-01-01": "2019-04-29"]

In [41]:
city_sum_fare_by_date_filter

type                 Rural  Suburban  Urban
date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
...                    ...       ...    ...
2019-04-28 14:28:36    NaN       NaN  11.46
2019-04-28 16:29:16    NaN       NaN  36.42
2019-04-28 17:26:52    NaN       NaN  31.43
2019-04-28 17:38:09    NaN     34.87    NaN
2019-04-28 19:35:03    NaN     16.96    NaN

[2196 rows x 3 columns]

In [44]:
# Step 13 df.index = pd.to_datetime(df.index)
city_sum_fare_by_date_filter.index = pd.to_datetime(city_sum_fare_by_date_filter.index)
city_sum_fare_by_date_filter

type                 Rural  Suburban  Urban
date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
...                    ...       ...    ...
2019-04-28 14:28:36    NaN       NaN  11.46
2019-04-28 16:29:16    NaN       NaN  36.42
2019-04-28 17:26:52    NaN       NaN  31.43
2019-04-28 17:38:09    NaN     34.87    NaN
2019-04-28 19:35:03    NaN     16.96    NaN

[2196 rows x 3 columns]

In [45]:
#step 14
city_sum_fare_by_date_filter.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2196 entries, 2019-01-01 00:08:16 to 2019-04-28 19:35:03
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Rural     114 non-null    float64
 1   Suburban  573 non-null    float64
 2   Urban     1509 non-null   float64
dtypes: float64(3)
memory usage: 68.6 KB

In [46]:
city_sum_fare_by_date_week = city_sum_fare_by_date_filter.resample("W").sum()
city_sum_fare_by_date_week.head(10)

type         Rural  Suburban    Urban
date
2019-01-06  187.92    721.60  1661.68
2019-01-13   67.65   1105.13  2050.43
2019-01-20  306.00   1218.20  1939.02
2019-01-27  179.69   1203.28  2129.51
2019-02-03  333.08   1042.79  2086.94
2019-02-10  115.80    974.34  2162.64
2019-02-17   95.82   1045.50  2235.07
2019-02-24  419.06   1412.74  2466.29
2019-03-03  175.14    858.46  2218.20
2019-03-10  303.94    925.27  2470.93

In [47]:
city_sum_fare_by_date_month = city_sum_fare_by_date_filter.resample("M").sum()
city_sum_fare_by_date_month.head(10)

type          Rural  Suburban    Urban
date
2019-01-31   940.00   4796.08  9054.33
2019-02-28   919.17   4442.70  8875.99
2019-03-31   877.50   4341.99  9845.95
2019-04-30  1177.02   4302.57  9289.51

In [48]:
city_sum_fare_by_date_day = city_sum_fare_by_date_filter.resample("D").sum()
city_sum_fare_by_date_day.head(10)

type        Rural  Suburban   Urban
date
2019-01-01  43.69    128.52  127.78
2019-01-02  52.12    274.92  305.99
2019-01-03  19.90    133.48  260.48
2019-01-04  24.88     20.69  258.14
2019-01-05   0.00    101.36  506.89
2019-01-06  47.33     62.63  202.40
2019-01-07   0.00    155.01  218.02
2019-01-08  19.39     56.82  379.79
2019-01-09  31.84    150.67  231.34
2019-01-10   0.00    348.12  206.23

In [49]:
city_sum_fare_by_date_year = city_sum_fare_by_date_filter.resample("Y").sum()
city_sum_fare_by_date_year.head(10)

type          Rural  Suburban     Urban
date
2019-12-31  3913.69  17883.34  37065.78

In [58]:
# Step 16. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 
# Import the style from Matplotlib.
from matplotlib import style

#Plot 
#city_sum_fare_by_date_week.plot(x="date" ,y="Rural")
#plt.show()